balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA004.PIC
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="LATC" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00uuuuuuuu" edc:name="LATC" edc:nzwidth="0x10" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC8" edc:desc="" edc:mask="0x1" edc:name="LATC8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATC" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="LATC" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="ODCC" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="ODCC" edc:nzwidth="0x10" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODC0" edc:desc="" edc:mask="0x1" edc:name="ODC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC1" edc:desc="" edc:mask="0x1" edc:name="ODC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC2" edc:desc="" edc:mask="0x1" edc:name="ODC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC3" edc:desc="" edc:mask="0x1" edc:name="ODC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC4" edc:desc="" edc:mask="0x1" edc:name="ODC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC5" edc:desc="" edc:mask="0x1" edc:name="ODC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC6" edc:desc="" edc:mask="0x1" edc:name="ODC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC7" edc:desc="" edc:mask="0x1" edc:name="ODC7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC8" edc:desc="" edc:mask="0x1" edc:name="ODC8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODC9" edc:desc="" edc:mask="0x1" edc:name="ODC9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODC" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ODC" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="36"/>
        <edc:SFRDef edc:access="--------------nn" edc:cname="PADCFG1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PADCFG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMPTTL" edc:desc="" edc:mask="0x1" edc:name="PMPTTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL0" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADC1BUF0" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADC1BUF0" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF0" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADC1BUF0" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADC1BUF1" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADC1BUF1" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF1" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADC1BUF1" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADC1BUF2" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADC1BUF2" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF2" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="ADC1BUF2" edc:nzwidth="0xa"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
